Repository: msdx/gradle-translation
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: 54.8.4. Selecting the build types, platforms and flavors for a component
zh_cn: 54.8.4. 为一个组件选择构建类型，平台和flavor

source: 54.8.5. Building all possible variants
zh_cn: 54.8.5. 构建所有可能的变种

source: 54.8. Native Binary Variants
zh_cn: 54.8. 本地二进制变种

source: 54.9.1. Defining tool chains
zh_cn: 54.9.1. 定义工具链

source: 54.9.2. Using tool chains
zh_cn: 54.9.2. 使用工具链

source: 54.9.3. Cross-compiling with GCC
zh_cn: 54.9.3. 使用GCC进行交叉编译

source: 54.9. Tool chains
zh_cn: 54.9. 工具链

source: 55.1. Build phases
zh_cn: 55.1. 构建阶段

source: 55.2. Settings file
zh_cn: 55.2. 设置文件

source: 55.3.1. Project locations
zh_cn: 55.3.1. 项目位置

source: 55.3.2.1. Hierarchical layouts
zh_cn: 55.3.2.1. 分层布局

source: 55.3.2.2. Flat layouts
zh_cn: 55.3.2.2. 平面布局

source: 55.3.2. Building the tree
zh_cn: 55.3.2. 生成树

source: 55.3.3. Modifying elements of the project tree
zh_cn: 55.3.3. 修改项目树元素

source: 55.3. Multi-project builds
zh_cn: 55.3. 多项目构建

source: 55.4. Initialization
zh_cn: 55.4. 初始化

source: 55.5. Configuration and execution of a single project build
zh_cn: 55.5. 配置和执行单个项目构建

source: 55.6.1. Project evaluation
zh_cn: 55.6.1. 项目评估

source: 55.6.2. Task creation
zh_cn: 55.6.2. 任务创建

source: 55.6.3. Task execution graph ready
zh_cn: 55.6.3. 任务执行图准备

source: 55.6.4. Task execution
zh_cn: 55.6.4. 任务执行

source: 55.6. Responding to the lifecycle in the build script
zh_cn: 55.6. 构建脚本生命周期的响应

source: 56.1.1.1. Configuration on demand
zh_cn: 56.1.1.1. 按需配置

source: 56.1.1. Configuration and execution
zh_cn: 56.1.1. 配置和执行

source: 56.1.2. Defining common behavior
zh_cn: 56.1.2. 定义共同行为

source: 56.1. Cross project configuration
zh_cn: 56.1. 跨项目配置

source: 56.10. Multi-Project Building and Testing
zh_cn: 56.10. 多项目构建和测试

source: 56.11. Property and method inheritance
zh_cn: 56.11. 属性和方法的继承

source: 56.12. Summary
zh_cn: 56.12. 总结

source: 56.2.1. Defining common behavior
zh_cn: 56.2.1. 定义共同行为

source: 56.2.2. Adding specific behavior
zh_cn: 56.2.2. 添加特定的行为

source: 56.2.3.1. Filtering by name
zh_cn: 56.2.3.1. 按名称过滤

source: 56.2.3.2. Filtering by properties
zh_cn: 56.2.3.2. 通过属性筛选

source: 56.2.3. Project filtering
zh_cn: 56.2.3. 项目筛选

source: 56.2. Subproject configuration
zh_cn: 56.2. 子项目配置

source: 56.3. Execution rules for multi-project builds
zh_cn: 56.3. 多项目构建的执行规则

source: 56.4. Running tasks by their absolute path
zh_cn: 56.4. 按绝对路径运行任务

source: 56.5. Project and task paths
zh_cn: 56.5. 项目和任务路径

source: 56.6.1.1. Dependencies and execution order
zh_cn: 56.6.1.1. 依赖和执行顺序

source: 56.6.1.2. Declaring dependencies
zh_cn: 56.6.1.2. 声明依赖

source: 56.6.1.3. The nature of cross project task dependencies
zh_cn: 56.6.1.3. 跨项目任务依赖的本质

source: 56.6.1. Execution dependencies
zh_cn: 56.6.1. 执行依赖

source: 56.6.2. Configuration time dependencies
zh_cn: 56.6.2. 配置时依赖

source: 56.6.3. Real life examples
zh_cn: 56.6.3. 实际生活中的例子

source: 56.6. Dependencies - Which dependencies?
zh_cn: 56.6. 依赖-哪些依赖？

source: 56.7.1. Disabling the build of dependency projects
zh_cn: 56.7.1. 禁止依赖项目的构建

source: 56.7. Project lib dependencies
zh_cn: 56.7. 项目库依赖

source: 56.8. Parallel project execution
zh_cn: 56.8. 并行项目执行

source: 56.9. Decoupled Projects
zh_cn: 56.9. 解耦的项目

source: 57.1. Packaging a task class
zh_cn: 57.1. 封装一个任务类

source: 57.2. Writing a simple task class
zh_cn: 57.2. 编写一个简单的任务类

source: 57.3. A standalone project
zh_cn: 57.3. 一个独立项目

source: 7.1. The Java plugin
zh_cn: 7.1. Java 插件

source: 8.1. What is dependency management?
zh_cn: 8.1. 什么是依赖管理？

source: 9.1. A basic Groovy project
zh_cn: 9.1. 一个基本的Groovy project

source: 9.2. Summary
zh_cn: 9.2. 总结

source: Bintray's JCenter is an up-to-date collection of all popular Maven OSS artifacts, including artifacts published directly to Bintray.
zh_cn: BintrayJCenter 是所有流行的 Maven OSS artifacts 的up-to-date 集合，包括直接发布到 Bintray 的 artifacts。

source: Previous|Contents|Next
zh_cn: 上一章|目录|下一章

source: Section 55.1, “Build phases” describes the phases of every Gradle build.
zh_cn: 第 55.1 节，“构建阶段”描述了每个 Gradle 构建阶段。

source: Section 56.1.1.1, “Configuration on demand”.
zh_cn: 第 56.1.1.1 节，“按需配置”。

source: Table 52.4, “Configuration elements of the MavenDeployer” lists the available bean elements and a link to the javadoc of the corresponding class.
zh_cn: 表 52.4，"MavenDeployer 的配置元素"列出了可用的 bean 元素，以及 javadoc 中相应类的链接。

source: GroovyCompile and Groovydoc tasks consume Groovy in two ways: on their classpath, and on their groovyClasspath.
zh_cn: GroovyCompile和Groovydoc tasks 会以两种方式使用 Groovy： 在它们的classpath以及它们的groovyClasspath上。

source: ScalaCompile and ScalaDoc tasks consume Scala in two ways: on their classpath, and on their scalaClasspath.
zh_cn: ScalaCompile和ScalaDoc tasks 会以两种方式使用 Scala： 在它们的classpath以及scalaClasspath上。

source: beforeMerged { arg -> } argument type
zh_cn: beforeMerged { arg -> } 参数类型

source: build and build tasks in all project lib dependencies of the testRuntime configuration.
zh_cn: build任务，以及在testRuntime配置的所有项目库依赖项的build任务。

source: build and build tasks in all projects with a project lib dependency on this project in a testRuntime configuration.
zh_cn: build任务，以及在testRuntime配置中对此项目有库依赖的所有项目的build任务。

source: buildSrc project
zh_cn: buildSrc 项目

source: check and assemble
zh_cn: check 和 assemble

source: compile (only if the Java plugin is also applied)
zh_cn: compile（仅在也配置了使用 Java 插件的时候）

source: compile, compileTest, plus all tasks which produce the test runtime classpath.
zh_cn: compile， compileTest，再加上所有产生测试运行时类路径的任务。

source: compile, plus all tasks which produce the test compile classpath.
zh_cn: compile，再加上所有能产生测试编译类路径的任务。

source: compileSourceSet configuration.
zh_cn: compileSourceSet 配置。

source: compileSourceSetJava and processSourceSetResources.
zh_cn: compileSourceSetJava 和 processSourceSetResources。

source: compileJava and processResources.
zh_cn: compileJava和processResources。

source: compileTestJava and processTestResources.
zh_cn: compileTestJava和processTestResources。

source: dependencies returns only the dependencies belonging explicitly to the configuration.
zh_cn: dependencies返回只明确属于配置的依赖。

source: groovy configuration if non-empty; Groovy library found on classpath otherwise
zh_cn: 如果groovy 配置不为空，则为该配置；否则为 classpath 中找到的 Groovy 库

source: module-a depends on releasable-unit:part-one:1.0
zh_cn: module-a 依赖于 releasable-unit:part-one:1.0

source: module-b depends on releasable-unit:part-two:1.1
zh_cn: module-a 依赖于 releasable-unit:part-one:1.0

source: output + runtimeSourceSet configuration.
zh_cn: output + runtimeSourceSet 配置。

source: whenMerged { arg -> } argument type
zh_cn: whenMerged { arg -> } 参数类型

source: withXml { arg -> } argument type
zh_cn: withXml { arg -> } 参数类型

source: webDist has a configuration dependency on date and hello because it needs to know the archivePath.
zh_cn: webDist有一个配置 依赖于 date 和 hello，因为它需要知道 archivePath。

source: allDependencies includes the dependencies from extended configurations.
zh_cn: allDependencies包括了扩展配置的依赖。

source: fsc runs in a separate daemon process and can speed up compilation significantly.
zh_cn: fsc运行在一个单独的进程中，并且可以显著地提高编译速度。

source: OsgiManifest extends Manifest.
zh_cn: OsgiManifest 继承自 Manifest。

source: personService has a lib dependency on the other two projects.
zh_cn: personService 对其他两个项目有一个库依赖。

source: api has a lib dependency on shared.
zh_cn: api 对 shared有一个库依赖。

source: archiveTask.baseName defaults to project.archivesBaseName which in turn defaults to project.name.
zh_cn: archiveTask.baseName默认为project.archivesBaseName，后者默认为project.name。

source: A fully customizable approach to Dependency Resolution: Gradle provides you with the ability to customize resolution rules making dependency substitution easy.
zh_cn: 一个完全可自定义的依赖解析的方法：Gradle 为你提供了自定义解析规则的能力，让你可以轻松替换依赖。

source: Fail: A version conflict results in a build failure.
zh_cn: Fail：一个版本冲突将导致构建失败。

source: Full Compatibility with Maven and Ivy: If you have defined dependencies in a Maven POM or an Ivy file, Gradle provide seamless integration with a range of popular build tools.
zh_cn: 完全兼容 Maven 和 Ivy ：如果你已经在 Maven POM 文件或 Ivy 文件中定义了依赖，Gradle 提供了一系列受欢迎的构建工具可以进行无缝集成。

source: If you think version conflicts don't happen to you, think again. It is very common for different first-level dependencies to rely on a range of different overlapping versions for other dependencies, and the JVM doesn't yet offer an easy way to have different versions of the same jar in the classpath (see Section 50.1.2, “Dependency management and Java”).
zh_cn: 如果你觉得你不会发生版本冲突，再想想。 不同的第一级依赖，依赖于一系列不同的重叠版本的其他依赖，这种情况是很常见的，而 JVM 还不能提供简单的方法，使得能在类路径中让相同的 jar 包可以有不同的版本（请参阅第 50.1.2 节，“依赖管理和 Java”）。

source: Integration with existing dependency management infrastructure: Gradle is compatible with both Maven and Ivy repositories.
zh_cn: 与现有依赖管理基础结构的集成：Gradle 兼容 Maven 和 Ivy 仓库。

source: NOTE:In one project, we found a mystery, LDAP related jar in the classpath.
zh_cn: 注： 在一个项目中，我们发现在类路径中有一个神秘、LDAP 相关的 jar 包。

source: Newest: The newest version of the dependency is used.
zh_cn: Newest：使用最新版本的依赖

source: Note: The code for this example can be found at samples/groovy/quickstart which is in both the binary and source distributions of Gradle.
zh_cn: 注意： 此例子的代码可以在Gradle的二进制文件或源码中的 samples/groovy/quickstart 里看到。

source: Note: The code for this example can be found at samples/native-binaries/cunit which is in both the binary and source distributions of Gradle.
zh_cn: 注意︰ 此示例的代码可以在Gradle 的 binary 或 source 分发包的samples/native-binaries/cunit中找到。。

source: Note: The code for this example can be found at samples/testing/jacoco/application which is in both the binary and source distributions of Gradle.
zh_cn: 注: 此示例中的代码可以在Gradle 的二进制分发包及源代码分发包中的samples/testing/jacoco/application中找到。

source: Note: The code for this example can be found at samples/userguide/multiproject/addKrill/water which is in both the binary and source distributions of Gradle.
zh_cn: 注︰ 此示例的代码可以在Gradle 的二进制及源码分发包的samples/userguide/multiproject/addKrill/water中找到。

source: Note: The code for this example can be found at samples/userguide/multiproject/addTropical/water which is in both the binary and source distributions of Gradle.
zh_cn: 注︰ 此示例的代码可以在Gradle 的二进制及源码分发包的samples/userguide/multiproject/addTropical/water中找到。

source: Note: The code for this example can be found at samples/userguide/multiproject/dependencies/firstMessages/messages which is in both the binary and source distributions of Gradle.
zh_cn: 注︰ 此示例的代码可以在 Gradle 二进制和源码分发包的samples/userguide/multiproject/dependencies/firstMessages/messages中找到。

source: Note: The code for this example can be found at samples/userguide/multiproject/dependencies/java which is in both the binary and source distributions of Gradle.
zh_cn: 注︰ 此示例的代码可以在 Gradle 二进制和源码分发包的samples/userguide/multiproject/dependencies/java/messages中找到。

source: Note: The code for this example can be found at samples/userguide/multiproject/dependencies/messagesWithDependencies/messages which is in both the binary and source distributions of Gradle.
zh_cn: 注︰ 此示例的代码可以在 Gradle 二进制和源码分发包的samples/userguide/multiproject/dependencies/messagesWithDependencies/messages中找到。

source: Note: The code for this example can be found at samples/userguide/multiproject/dependencies/webDist which is in both the binary and source distributions of Gradle.
zh_cn: 注︰ 此示例的代码可以在 Gradle 二进制和源码分发包的samples/userguide/multiproject/dependencies/webDist/messages中找到。

source: Note: The code for this example can be found at samples/userguide/multiproject/firstExample/water which is in both the binary and source distributions of Gradle.
zh_cn: 注︰ 此示例的代码可以在Gradle 的二进制及源码分发包的samples/userguide/multiproject/firstExample/water中找到。

source: Note: The code for this example can be found at samples/userguide/multiproject/spreadSpecifics/water which is in both the binary and source distributions of Gradle.
zh_cn: 注︰ 此示例的代码可以在Gradle 的二进制及源码分发包的samples/userguide/multiproject/spreadSpecifics/water中找到。

source: Note: The code for this example can be found at samples/userguide/multiproject/tropicalWithProperties/water which is in both the binary and source distributions of Gradle.
zh_cn: 注︰ 此示例的代码可以在Gradle 的二进制及源码分发包的samples/userguide/multiproject/tropicalWithProperties/water中找到。

source: Note: The code for this example can be found at samples/webApplication/quickstart which is in both the binary and source distributions of Gradle.
zh_cn: 注：此例子代码可以在Gradle的二进制文件或源码当中的samples/webApplication/quickstart里找到。

source: Support for custom dependency definitions.: Gradle's Module Dependencies give you the ability to describe the dependency hierarchy in the build script.
zh_cn: 支持依赖定义的自定义：Gradle 的模块依赖给你在构建脚本中描述依赖项层次结构的能力。

source: Support for non-managed dependencies: If your dependencies are simply files in version control or a shared drive, Gradle provides powerful functionality to support this.
zh_cn: 对非管理依赖的支持：如果你的依赖只是版本控制下或共享的驱动器中的文件，Gradle 也提供了强大的功能以支持这种情况。

source: The Gradle daemon (sometimes referred as the build daemon) aims to improve the startup and execution time of Gradle.
zh_cn: Gradle 守护进程（有时也称为构建守护进程） 的目的是改善 Gradle 的启动和执行时间。

source: Transitive dependency management: Gradle gives you full control of your project's dependency tree.
zh_cn: 依赖管理传递： Gradle 赋予你对你的项目依赖项树的完全控制。

source: [10] The TestNG documentation contains more details about test groups: http://testng.org/doc/documentation-main.html#test-groups.
zh_cn: [10] TestNG 文档包含了有关测试组的更多详细信息： http://testng.org/doc/documentation-main.html#test-groups。

source: [10] The test groups that should be included or excluded from the test execution can be configured in the test task.
zh_cn: [10]应从测试执行中include或exclude的测试组，可以在test任务中配置。

source: [11] We are using the same conventions as introduced by Russel Winder's Gant tool (http://gant.codehaus.org).
zh_cn: [11] 我们使用和 Russel Winder 的 Gant 工具同样的约定（http://gant.codehaus.org）。

source: [12] See Section 25.5, “Automatic configuration of scalaClasspath”.
zh_cn: [12]参阅第 25.5 节，“scalaClasspath 的自动配置”。

source: [13] The runtime configuration extends the compile configuration.
zh_cn: [13]runtime配置继承自compile配置。

source: [14] Gradle supports partial multiproject builds (see Chapter 56, Multi-project Builds).
zh_cn: [14] Gradle 支持部分多项目构建（参见 第 56 章， 多项目构建）。

source: [14] And sometimes you want to download a zip from a repository, that does not have module descriptors.
zh_cn: [14] 而有时候你想要从一个仓库中下载一个 zip，而它没有模块描述符。

source: [15] Gradle supports this.
zh_cn: [15] 而 Gradle 支持这一点。

source: [16] At http://ant.apache.org/ivy/history/latest-milestone/concept.html you can learn more about ivy patterns.
zh_cn: [16] 在http://ant.apache.org/ivy/history/latest-milestone/concept.html，你可以了解到更多关于 ivy 模式的内容。

source: [17] If you want to shield your project from the downtimes of Maven Central things get more complicated.
zh_cn: [17] 如果你想要从 Maven 中央仓库停机保护你的项目不变得更加复杂时，

source: [17] But it can be tedious, to keep it up to date.
zh_cn: [17]但想让这个仓库保持最新的状态，可能会很乏味。

source: [18] To be exact, the Base plugin provides those tasks.
zh_cn: [18] 确切地说，Base插件提供了这些任务。

source: [19] It is planned for a future release to provide out-of-the-box support for this
zh_cn: [19] 已经计划在将来的发行版中为其提供开箱即用的支持。

source: [20] Gradle supports partial multiproject builds (see Chapter 56, Multi-project Builds).
zh_cn: [20] Gradle 支持部分多项目构建（参见 第 56 章， 多项目建）。

source: [20] If you execute Gradle from within a project that has no settings.gradle file, Gradle does the following:
zh_cn: [20]如果你在没有settings.gradle文件的项目中执行从 Gradle，Gradle 将执行以下操作︰

source: [21] The real use case we had, was using http://lucene.apache.org/solr, where you need a separate war for each index you are accessing.
zh_cn: [21] 我们真正的使用情况，正使用http://lucene.apache.org/solr，在上面你所访问的每一个索引你都需要一个单独的war。

source: [21] For the example we use only one build script and do cross project configuration.
zh_cn: [21] 对于这个例子，我们仅使用了一个构建脚本，并且进行了跨项目的配置。

source: [22] services is also a project, but we use it just as a container.
zh_cn: [22] services 也是一个项目，但我们只是把它用作一个容器。

source: [23] We do this here, as it makes the layout a bit easier.
zh_cn: [23] 我们在这里实现，因为它可以使布局更容易。

source: [24] So we are well in the range of the 7 plus 2 Rule :)
zh_cn: [24] 因为在 7 plus 2 Rule 的范围内我们做得很好:)

source: [5] As of Gradle 1.0-milestone-9, using ext to add extra properties is strongly encouraged but not yet enforced.
zh_cn: [5] 截至 Gradle 1.0-milestone-9版本，我们鼓励但不强制要求使用 ext 来添加额外属性

source: [5] Extra properties can be accessed from anywhere their owning object can be accessed, giving them a wider scope than local variables.
zh_cn: [5]额外属性在任何能够访问它们所属的对象的地方都可以被访问，这使它们有着比局部变量更广泛的作用域。

source: [6] Teamcity or Bamboo are for example CI servers which offer this functionality.
zh_cn: [6] Teamcity或Bamboo就是提供这个功能的 CI 服务器的例子。

source: [7] You might be wondering why there is neither an import for the StopExecutionException nor do we access it via its fully qualified name.
zh_cn: [7]你可能会想，为什么既不导入StopExecutionException也没有通过其完全限定名来访问它。

source: [8] In Groovy you can execute Strings.
zh_cn: [8] In Groovy you can execute 字符串表示的命令。

source: [9] The JUnit wiki contains a detailed description on how to work with JUnit categories: https://github.com/junit-team/junit/wiki/Categories.
zh_cn: [9] JUnit wiki 包含了有关如何使用 JUnit 类别的详细说明： https://github.com/junit-team/junit/wiki/Categories。

source: [9] The test task allows the specification of the JUnit categories you want to include and exclude.
zh_cn: [9] test任务可以实现一个规范，让你include和exclude 想要的 JUnit 类别。

source: [23] A lib dependency is a special form of an execution dependency.
zh_cn: [23] 一个 lib 依赖是一种特殊形式的执行依赖。

source: [19] For example to use the ssh protocol you can do:
zh_cn: [19] 举个例子，要使用ssh协议，你可以：

source: [11] None of these directories need to exist or have anything in them; the Groovy plugin will simply compile whatever it finds.
zh_cn: [11]这些目录不一定得存在或是里面包含有什么内容；Groovy 的插件只会进行编译，而不管它发现什么。

source: [18] Execution of these tasks will build or upload the artifacts belonging to the respective configuration.
zh_cn: [18]这些任务的执行将会构建或上传属于各自配置的构件。

source: [24] With those elements, and keeping in mind that Gradle has a distinct configuration and execution phase, you have already a lot of flexibility.
zh_cn: [24] 使用这些元素，并记住 Gradle 具有不同的配置和执行阶段，你就已经可以很灵活地使用它。

source: [6] If the environment property follows the pattern ORG_GRADLE_PROJECT_propertyName=somevalue, propertyName is added to your project object.
zh_cn: [6]如果环境属性遵循ORG_GRADLE_PROJECT_propertyName= somevalue的模式，这里的propertyName会被添加到您的项目对象中。

source: > gradle -a :api:build :api:compileJava :api:processResources :api:classes :api:jar :api:assemble :api:compileTestJava :api:processTestResources :api:testClasses :api:test :api:check :api:build BUILD SUCCESSFUL Total time: 1 secs
zh_cn: -> gradle :api:build :shared:compileJava :shared:processResources :shared:classes :shared:jar :api:compileJava :api:processResources :api:classes :api:jar :api:assemble :api:compileTestJava :api:processTestResources :api:testClasses :api:test :api:check :api:build BUILD SUCCESSFUL Total time: 1 secs

source: > gradle -q consume Producing message: Consuming message: Watch the order of execution.
zh_cn: -> gradle -q action Producing message: Consuming message: Watch the order of execution.

source: A CUnitTestSuite component has an associated Executable or Library component.
zh_cn: 一个 CUnitTestSuite 组件会有一个相关联的 Executable 或 Library 组件。

source: A complete overwrite causes all existing content to be discarded, thereby losing any changes made directly in the IDE.
zh_cn: 一个完全覆盖会导致现有的所有内容被丢弃，从而丢失在 IDE 中直接做的任何修改。

source: A build type determines various non-functional aspects of a binary, such as whether debug information is included, or what optimisation level the binary is compiled with.
zh_cn: 一个 build type 确定了一个二进制文件的各种非功能性方面，比如是否包含调试信息，或者使用什么样的优化级别来编译二进制文件。

source: A file collection is simply a set of files.
zh_cn: 一个文件集合只是表示一组文件。

source: A file tree is a collection of files arranged in a hierarchy.
zh_cn: 文件树是按层次结构排序的文件集合。

source: A Gradle build has three distinct phases.
zh_cn: 一个 Gradle 构建具有三个明显的阶段。

source: A Gradle dependency offers the configuration property to declare this.
zh_cn: 一个Gradle依赖提供了configuration 属性来声明它。

source: A Maven repository.
zh_cn: 一个 Maven 仓库。

source: A Sonar property value set via a system property overrides any value set in a build script (for the same property).
zh_cn: 通过一个系统属性设置的 Sonar 属性值将覆盖构建脚本中设置的任何值（同样的属性名称）。

source: A basic Groovy project
zh_cn: 一个基本的Groovy 项目

source: A basic Java project
zh_cn: 一个基本的 Java 项目

source: A binary store of resolved module meta-data, including the results of resolving dynamic versions, module descriptors, and artifacts.
zh_cn: 解析的模块元数据的二进制存储，包括解析动态版本、 模块描述符和构件的结果。

source: A build depending on both module-a and module-b will obtain different versions of libraries within the releasable unit.
zh_cn: 一个依赖于module-a和module-b的构建，将在可发布单位内获得这个库的不同版本。

source: A collection of files with names like commons-beanutils-1.3.jar or a collection of files with names like spring.jar?
zh_cn: 一个文件命名为 beanutils-beanutils-1.3.jar 的集合，还是文件命名为 spring.jar 的集合？

source: A common example is a native executable component that uses functions provided by a separate native library component.
zh_cn: 一个常见的例子是一个本地可执行组件，使用了由一个单独的本地库组件提供的功能。

source: A common usage pattern is to only sign build artifacts under certain conditions.
zh_cn: 常见的使用模式是只在一定条件下签名构建的artifacts。

source: A copy spec inherits its destination path, include patterns, exclude patterns, copy actions, name mappings and filters.
zh_cn: 一个复制规范继承其目标路径，包含模式，排除模式，复制操作，名称映射和过滤器。

source: A copy spec is represented by the CopySpec interface.
zh_cn: 一个复制规范通过 CopySpec 接口来表示。

source: A couple of examples are shown below.
zh_cn: 下面展示了几个例子。

source: A dependency of a first level dependency might also be a first level dependency itself, or it might be a transitive dependency of yet another first level dependency.
zh_cn: 第一级依赖的依赖项也可能是第一级依赖本身，或者也可能是另一个第一级依赖的传递依赖。

source: A dependency on a set of files on the local filesystem.
zh_cn: 对本地文件系统中的一些文件的依赖

source: A dependency on an external module in some repository.
zh_cn: 对一些仓库中的外部模块的依赖

source: A dependency on an external module, where the artifacts are located in some repository but the module meta-data is specified by the local build.
zh_cn: 对外部模块的依赖，该块部模块的 artifacts 存储于一些仓库中，但是模块的元数据由本地构建指定。

source: A dependency on another project in the same build.
zh_cn: 在同一个构建中对另一个项目的依赖

source: A dependency on the API of the current Gradle version.
zh_cn: 对当前的 Gradle 版本的 API 的依赖

source: A dependency on the Groovy version used by the current Gradle version.
zh_cn: 对当前的 Gradle 所使用的 Groovy 版本的依赖。

source: A dependency resolve rule is executed for each resolved dependency, and offers a powerful api for manipulating a requested dependency prior to that dependency being resolved.
zh_cn: 一个依赖解析规则为每一个解析依赖执行，并提供功能强大的 api 用于在解析依赖之前处理这个依赖的请求。

source: A deployment descriptor with sensible defaults named application.xml
zh_cn: 部署描述符，它有一个合理的名为application.xml的默认值

source: A description for the project.
zh_cn: 项目的描述。

source: A dynamic version can be either a version range (e.g. 2.+) or it can be a placeholder for the latest version available (e.g. latest.integration).
zh_cn: 一个动态的版本可以是一个版本范围（例如2.+），也可以是表示可用的最新版本的占位符（例如latest.integration）。

source: A file collection is iterable, and can be converted to a number of other types using the as operator.
zh_cn: 一个文件集合是可迭代的，并且可以使用as操作符转换为其他类型的对象集合。

source: A file-based store of downloaded artifacts, including binaries like jars as well as raw downloaded meta-data like POM files and Ivy files.
zh_cn: 一个基于文件的下载构件存储，包括像jars这样的二进制文件，以及像 POM 文件以及 Ivy 文件这样的原始下载的元数据。

source: A fresh resolve will be performed against all configured repositories, with dynamic versions recalculated, modules refreshed, and artifacts downloaded.
zh_cn: 对所有已配置的仓库执行新的解析，通过重新计算动态版本，模块刷新，以及下载构件。

source: A list of available Sonar properties can be found in the Sonar documentation.
zh_cn: Sonar 的可用属性的列表可以在Sonar 文档中找到。
